Can't end Stairs with Riser because Riser Thickness is too small.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotEndWithZeroRiser { get; }
  Visual Basic
Public Shared ReadOnly Property CannotEndWithZeroRiser As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotEndWithZeroRiser {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace